my_string = input()
print(len(my_string)) # Функция "len()" (это всегда целое число) в питоне возвращает количество символов в строке, ей можно подсчитать:количество символов в строке, цифр в числе, если перевести его в строку, байт в строке (если указать кодировку).
print(my_string.upper()) # вывод в верхнем регистре
print(my_string.lower()) # выывод в нижнем регистре
print(my_string.replace(" ","")) # убрать все пробелы
print(my_string[0]) # вывод только первого символа слова
print(my_string[-1]) # вывод только последнего символа слова